ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_Silicon_Labs/TARGET_EFM32/serial_api.c
void serial_init(serial_t *obj, PinName tx, PinName rx)
{
    uint32_t baudrate;
    uint32_t uart_for_stdio = false;

    serial_preinit(obj, tx, rx);

    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        // Set up LEUART clock tree
#ifdef LEUART_USING_LFXO
        //set to use LFXO
        CMU_ClockEnable(cmuClock_CORELE, true);
        CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFXO);
#else
        //set to use high-speed clock
#ifdef _SILICON_LABS_32B_PLATFORM_2
        CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_HFCLKLE);
#else
        CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_CORELEDIV2);
#endif
#endif
    }

    CMU_ClockEnable(serial_get_clock(obj), true);

    /* Limitations of board controller: CDC port only supports 115kbaud */
    if((tx == STDIO_UART_TX) && (rx == STDIO_UART_RX)
       && (obj->serial.periph.uart == (USART_TypeDef*)STDIO_UART )
      ) {
        baudrate = 115200;
        uart_for_stdio = true;
    } else {
        baudrate = 9600;
    }

    /* Configure UART for async operation */
    uart_init(obj, baudrate, ParityNone, 1);

    /* Enable pins for UART at correct location */
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
#ifdef _LEUART_ROUTE_LOCATION_SHIFT
        obj->serial.periph.leuart->ROUTE = LEUART_ROUTE_RXPEN | LEUART_ROUTE_TXPEN | (obj->serial.location << _LEUART_ROUTE_LOCATION_SHIFT);
#else
        obj->serial.periph.leuart->ROUTELOC0 = (obj->serial.location_tx << _LEUART_ROUTELOC0_TXLOC_SHIFT) |
                                               (obj->serial.location_rx << _LEUART_ROUTELOC0_RXLOC_SHIFT);
        obj->serial.periph.leuart->ROUTEPEN = LEUART_ROUTEPEN_RXPEN | LEUART_ROUTEPEN_TXPEN;
#endif
        obj->serial.periph.leuart->IFC = LEUART_IFC_TXC;
        obj->serial.periph.leuart->CTRL |= LEUART_CTRL_RXDMAWU | LEUART_CTRL_TXDMAWU;
    } else {
#ifdef _USART_ROUTE_LOCATION_SHIFT
        obj->serial.periph.uart->ROUTE = USART_ROUTE_RXPEN | USART_ROUTE_TXPEN | (obj->serial.location << _USART_ROUTE_LOCATION_SHIFT);
#else
        obj->serial.periph.uart->ROUTELOC0 = (obj->serial.location_tx << _USART_ROUTELOC0_TXLOC_SHIFT) |
                                             (obj->serial.location_rx << _USART_ROUTELOC0_RXLOC_SHIFT);
        obj->serial.periph.uart->ROUTEPEN = USART_ROUTEPEN_RXPEN | USART_ROUTEPEN_TXPEN;
#endif
        obj->serial.periph.uart->IFC = USART_IFC_TXC;
    }

    /* If this is the UART to be used for stdio, copy it to the stdio_uart struct */
    if(uart_for_stdio) {
        stdio_uart_inited = 1;
        memcpy(&stdio_uart, obj, sizeof(serial_t));
    }

    serial_enable_pins(obj, true);
    serial_enable(obj, true);

    obj->serial.dmaOptionsTX.dmaChannel = -1;
    obj->serial.dmaOptionsTX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;

    obj->serial.dmaOptionsRX.dmaChannel = -1;
    obj->serial.dmaOptionsRX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;

}

void serial_free(serial_t *obj)
{
    if( LEUART_REF_VALID(obj->serial.periph.leuart) ) {
        LEUART_Enable(obj->serial.periph.leuart, leuartDisable);
    } else {
        USART_Enable(obj->serial.periph.uart, usartDisable);
    }
}

static void serial_enable(serial_t *obj, uint8_t enable)
{
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        if (enable) {
            LEUART_Enable(obj->serial.periph.leuart, leuartEnable);
        } else {
            LEUART_Enable(obj->serial.periph.leuart, leuartDisable);
        }
    } else {
        if (enable) {
            USART_Enable(obj->serial.periph.uart, usartEnable);
        } else {
            USART_Enable(obj->serial.periph.uart, usartDisable);
        }
    }
    serial_irq_ids[serial_get_index(obj)] = 0;
}

/**
 * Set UART baud rate
 */
void serial_baud(serial_t *obj, int baudrate)
{
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        serial_leuart_baud(obj, baudrate);
    } else {
        USART_BaudrateAsyncSet(obj->serial.periph.uart, 0, (uint32_t)baudrate, usartOVS16);
    }
}

/**
 * Set LEUART baud rate
 * Calculate whether LF or HF clock should be used.
 */
static void serial_leuart_baud(serial_t *obj, int baudrate)
{
#ifdef LEUART_USING_LFXO
    /* check if baudrate is within allowed range */
#if defined(_SILICON_LABS_32B_PLATFORM_2)
    // P2 has 9 bits + 5 fractional bits in LEUART CLKDIV register
    MBED_ASSERT(baudrate >= (LEUART_LF_REF_FREQ >> 9));
#else
    // P1 has 7 bits + 5 fractional bits in LEUART CLKDIV register
    MBED_ASSERT(baudrate >= (LEUART_LF_REF_FREQ >> 7));
#endif

    if(baudrate > (LEUART_LF_REF_FREQ >> 1)){
        // Baudrate is bigger than LFCLK/2 - we need to use the HF clock
        uint8_t divisor = 1;

#if defined(_SILICON_LABS_32B_PLATFORM_2)
        /* Check if baudrate is within allowed range: (HFCLK/4096, HFCLK/2] */
        MBED_ASSERT((baudrate <= (LEUART_HF_REF_FREQ >> 1)) && (baudrate > (LEUART_HF_REF_FREQ >> 12)));

        CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_HFCLKLE);

        if(baudrate > (LEUART_HF_REF_FREQ >> 9)){
            divisor = 1;
        }else if(baudrate > (LEUART_HF_REF_FREQ >> 10)){
            divisor = 2;
        }else if(baudrate > (LEUART_HF_REF_FREQ >> 11)){
            divisor = 4;
        }else{
            divisor = 8;
        }
#else // P1
        /* Check if baudrate is within allowed range */
        MBED_ASSERT((baudrate <= (LEUART_HF_REF_FREQ >> 1)) && (baudrate > (LEUART_HF_REF_FREQ >> 10)));

        CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_CORELEDIV2);

        if(baudrate > (LEUART_HF_REF_FREQ >> 7)){
            divisor = 1;
        }else if(baudrate > (LEUART_HF_REF_FREQ >> 8)){
            divisor = 2;
        }else if(baudrate > (LEUART_HF_REF_FREQ >> 9)){
            divisor = 4;
        }else{
            divisor = 8;
        }
#endif
        CMU_ClockDivSet(serial_get_clock(obj), divisor);
        LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_HF_REF_FREQ/divisor, (uint32_t)baudrate);
    }else{
        CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_LFXO);
        CMU_ClockDivSet(serial_get_clock(obj), 1);
        LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_LF_REF_FREQ, (uint32_t)baudrate);
    }
#else
    /* check if baudrate is within allowed range */
    MBED_ASSERT((baudrate > (LEUART_REF_FREQ >> 10)) && (baudrate <= (LEUART_REF_FREQ >> 1)));
    uint8_t divisor = 1;
    if(baudrate > (LEUART_REF_FREQ >> 7)){
        divisor = 1;
    }else if(baudrate > (LEUART_REF_FREQ >> 8)){
        divisor = 2;
    }else if(baudrate > (LEUART_REF_FREQ >> 9)){
        divisor = 4;
    }else{
        divisor = 8;
    }
    CMU_ClockDivSet(serial_get_clock(obj), divisor);
    LEUART_BaudrateSet(obj->serial.periph.leuart, LEUART_REF_FREQ/divisor, (uint32_t)baudrate);
#endif
}

/**
 * Set UART format by re-initializing the peripheral.
 */
void serial_format(serial_t *obj, int data_bits, SerialParity parity, int stop_bits)
{
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        /* Save the serial state */
        uint8_t     was_enabled = LEUART_StatusGet(obj->serial.periph.leuart) & (LEUART_STATUS_TXENS | LEUART_STATUS_RXENS);
        uint32_t    enabled_interrupts = obj->serial.periph.leuart->IEN;

        LEUART_Init_TypeDef init = LEUART_INIT_DEFAULT;

